---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIweldedTopflangethickness
source: html/b179e041-525c-e792-515b-8801466a15b3.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StructuralSectionIweldedTopflangethickness Property

"Top Flange Thickness"

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralSectionIweldedTopflangethickness { get; }
```